testing/archive/load_test_4_24_2025__1_28_22_pm.log
2025-04-24 13:28:22,988 - Test start time: 4_24_2025__1_28_22_pm
2025-04-24 13:28:23,271 - Test Started: 15:28 rate: 8 pods: 6
2025-04-24 13:29:23,575 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 30.934ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.73ms    4.01ms  23.31ms   59.03%
    Req/Sec     7.98     34.89   285.00     94.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.01ms
 75.000%   11.84ms
 90.000%   14.32ms
 99.000%   17.39ms
 99.900%   23.33ms
 99.990%   23.33ms
 99.999%   23.33ms
100.000%   23.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.721     0.000000            1         1.00
       4.029     0.100000           40         1.11
       4.763     0.200000           80         1.25
       5.619     0.300000          118         1.43
       6.799     0.400000          158         1.67
       8.007     0.500000          197         2.00
       9.007     0.550000          217         2.22
       9.527     0.600000          236         2.50
      10.127     0.650000          256         2.86
      10.943     0.700000          276         3.33
      11.839     0.750000          295         4.00
      12.583     0.775000          305         4.44
      12.903     0.800000          315         5.00
      13.359     0.825000          325         5.71
      13.639     0.850000          335         6.67
      13.935     0.875000          344         8.00
      14.047     0.887500          350         8.89
      14.319     0.900000          354        10.00
      14.863     0.912500          359        11.43
      14.967     0.925000          364        13.33
      15.375     0.937500          369        16.00
      15.503     0.943750          371        17.78
      15.871     0.950000          374        20.00
      15.911     0.956250          376        22.86
      16.159     0.962500          379        26.67
      16.295     0.968750          381        32.00
      16.343     0.971875          382        35.56
      16.399     0.975000          384        40.00
      16.591     0.978125          385        45.71
      16.671     0.981250          386        53.33
      16.943     0.984375          387        64.00
      17.167     0.985938          388        71.11
      17.391     0.987500          389        80.00
      17.391     0.989062          389        91.43
      17.551     0.990625          390       106.67
      17.551     0.992188          390       128.00
      17.663     0.992969          391       142.22
      17.663     0.993750          391       160.00
      17.663     0.994531          391       182.86
      18.463     0.995313          392       213.33
      18.463     0.996094          392       256.00
      18.463     0.996484          392       284.44
      18.463     0.996875          392       320.00
      18.463     0.997266          392       365.71
      23.327     0.997656          393       426.67
      23.327     1.000000          393          inf
#[Mean    =        8.728, StdDeviation   =        4.005]
#[Max     =       23.312, Total count    =          393]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  481 requests in 1.00m, 5.99MB read
Requests/sec:      8.01
Transfer/sec:    102.28KB

2025-04-24 13:29:23,860 - Test completed: wrk2 -t1 -c8 -d60s -R8 --latency http://128.105.146.155/
2025-04-24 13:29:24,130 - Test Started: 15:29 rate: 12 pods: 5
2025-04-24 13:30:24,444 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 44.174ms, rate sampling interval: 31ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.50ms    4.02ms  24.82ms   63.41%
    Req/Sec    12.02     40.24   233.00     91.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.70ms
 75.000%   11.44ms
 90.000%   14.49ms
 99.000%   18.03ms
 99.900%   23.22ms
 99.990%   24.83ms
 99.999%   24.83ms
100.000%   24.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.407     0.000000            1         1.00
       3.941     0.100000           60         1.11
       4.575     0.200000          119         1.25
       5.451     0.300000          178         1.43
       6.467     0.400000          238         1.67
       7.703     0.500000          297         2.00
       8.439     0.550000          327         2.22
       9.151     0.600000          356         2.50
       9.911     0.650000          386         2.86
      10.799     0.700000          416         3.33
      11.439     0.750000          445         4.00
      11.879     0.775000          461         4.44
      12.255     0.800000          475         5.00
      12.671     0.825000          490         5.71
      13.279     0.850000          505         6.67
      13.743     0.875000          519         8.00
      14.199     0.887500          527         8.89
      14.495     0.900000          534        10.00
      14.743     0.912500          542        11.43
      15.039     0.925000          549        13.33
      15.263     0.937500          556        16.00
      15.447     0.943750          560        17.78
      15.575     0.950000          564        20.00
      15.647     0.956250          570        22.86
      15.663     0.962500          571        26.67
      15.863     0.968750          575        32.00
      15.919     0.971875          577        35.56
      16.007     0.975000          579        40.00
      16.231     0.978125          581        45.71
      16.479     0.981250          582        53.33
      16.687     0.984375          584        64.00
      16.863     0.985938          585        71.11
      17.199     0.987500          586        80.00
      18.031     0.989062          587        91.43
      19.279     0.990625          588       106.67
      20.735     0.992188          589       128.00
      20.735     0.992969          589       142.22
      21.023     0.993750          590       160.00
      21.023     0.994531          590       182.86
      22.319     0.995313          591       213.33
      22.319     0.996094          591       256.00
      22.319     0.996484          591       284.44
      23.215     0.996875          592       320.00
      23.215     0.997266          592       365.71
      23.215     0.997656          592       426.67
      23.215     0.998047          592       512.00
      23.215     0.998242          592       568.89
      24.831     0.998437          593       640.00
      24.831     1.000000          593          inf
#[Mean    =        8.503, StdDeviation   =        4.020]
#[Max     =       24.816, Total count    =          593]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  721 requests in 1.00m, 8.92MB read
Requests/sec:     12.01
Transfer/sec:    152.24KB

2025-04-24 13:30:24,712 - Test completed: wrk2 -t1 -c8 -d60s -R12 --latency http://128.105.146.155/
2025-04-24 13:30:24,994 - Test Started: 15:30 rate: 16 pods: 4
2025-04-24 13:31:25,311 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 46.233ms, rate sampling interval: 32ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.76ms    4.44ms  27.74ms   64.56%
    Req/Sec    16.10     46.50   258.00     90.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.89ms
 75.000%   11.87ms
 90.000%   14.86ms
 99.000%   21.63ms
 99.900%   26.25ms
 99.990%   27.76ms
 99.999%   27.76ms
100.000%   27.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.203     0.000000            1         1.00
       3.807     0.100000           80         1.11
       4.563     0.200000          159         1.25
       5.495     0.300000          238         1.43
       6.519     0.400000          318         1.67
       7.891     0.500000          397         2.00
       8.431     0.550000          437         2.22
       9.335     0.600000          476         2.50
      10.103     0.650000          516         2.86
      10.919     0.700000          556         3.33
      11.871     0.750000          595         4.00
      12.191     0.775000          615         4.44
      12.863     0.800000          635         5.00
      13.391     0.825000          655         5.71
      13.895     0.850000          675         6.67
      14.439     0.875000          695         8.00
      14.575     0.887500          704         8.89
      14.863     0.900000          714        10.00
      15.271     0.912500          724        11.43
      15.543     0.925000          734        13.33
      15.807     0.937500          744        16.00
      15.959     0.943750          749        17.78
      16.087     0.950000          754        20.00
      16.431     0.956250          759        22.86
      16.815     0.962500          764        26.67
      17.471     0.968750          769        32.00
      17.823     0.971875          771        35.56
      18.527     0.975000          774        40.00
      19.535     0.978125          776        45.71
      20.143     0.981250          779        53.33
      20.783     0.984375          781        64.00
      20.815     0.985938          782        71.11
      21.119     0.987500          784        80.00
      21.631     0.989062          785        91.43
      21.727     0.990625          786       106.67
      21.967     0.992188          787       128.00
      22.639     0.992969          788       142.22
      23.519     0.993750          789       160.00
      23.519     0.994531          789       182.86
      24.511     0.995313          790       213.33
      24.511     0.996094          790       256.00
      25.999     0.996484          791       284.44
      25.999     0.996875          791       320.00
      25.999     0.997266          791       365.71
      26.255     0.997656          792       426.67
      26.255     0.998047          792       512.00
      26.255     0.998242          792       568.89
      26.255     0.998437          792       640.00
      26.255     0.998633          792       731.43
      27.759     0.998828          793       853.33
      27.759     1.000000          793          inf
#[Mean    =        8.765, StdDeviation   =        4.438]
#[Max     =       27.744, Total count    =          793]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  961 requests in 1.00m, 11.71MB read
Requests/sec:     16.01
Transfer/sec:    199.79KB

2025-04-24 13:31:25,607 - Test completed: wrk2 -t1 -c8 -d60s -R16 --latency http://128.105.146.155/
2025-04-24 13:31:25,884 - Test Started: 15:31 rate: 18 pods: 3
2025-04-24 13:32:26,188 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 16.182ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.07ms    5.59ms  36.90ms   73.44%
    Req/Sec    18.04     44.19   195.00     87.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.94ms
 75.000%   13.23ms
 90.000%   16.78ms
 99.000%   28.78ms
 99.900%   34.85ms
 99.990%   36.93ms
 99.999%   36.93ms
100.000%   36.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.371     0.000000            1         1.00
       4.079     0.100000           91         1.11
       5.203     0.200000          180         1.25
       6.407     0.300000          269         1.43
       7.675     0.400000          360         1.67
       8.935     0.500000          450         2.00
       9.607     0.550000          494         2.22
      10.599     0.600000          538         2.50
      11.335     0.650000          583         2.86
      12.295     0.700000          628         3.33
      13.231     0.750000          672         4.00
      13.647     0.775000          695         4.44
      14.039     0.800000          717         5.00
      14.391     0.825000          740         5.71
      14.895     0.850000          762         6.67
      15.575     0.875000          784         8.00
      16.023     0.887500          797         8.89
      16.847     0.900000          809        10.00
      17.711     0.912500          818        11.43
      18.111     0.925000          829        13.33
      19.647     0.937500          840        16.00
      20.207     0.943750          846        17.78
      20.879     0.950000          852        20.00
      21.407     0.956250          857        22.86
      22.687     0.962500          863        26.67
      23.615     0.968750          868        32.00
      23.791     0.971875          871        35.56
      24.911     0.975000          874        40.00
      25.615     0.978125          877        45.71
      27.295     0.981250          880        53.33
      27.519     0.984375          882        64.00
      27.583     0.985938          885        71.11
      27.583     0.987500          885        80.00
      28.783     0.989062          887        91.43
      29.535     0.990625          888       106.67
      29.583     0.992188          889       128.00
      30.255     0.992969          890       142.22
      32.175     0.993750          891       160.00
      33.727     0.994531          892       182.86
      33.727     0.995313          892       213.33
      34.335     0.996094          893       256.00
      34.335     0.996484          893       284.44
      34.495     0.996875          894       320.00
      34.495     0.997266          894       365.71
      34.495     0.997656          894       426.67
      34.847     0.998047          895       512.00
      34.847     0.998242          895       568.89
      34.847     0.998437          895       640.00
      34.847     0.998633          895       731.43
      34.847     0.998828          895       853.33
      36.927     0.999023          896      1024.00
      36.927     1.000000          896          inf
#[Mean    =       10.068, StdDeviation   =        5.593]
#[Max     =       36.896, Total count    =          896]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1081 requests in 1.00m, 13.63MB read
Requests/sec:     18.01
Transfer/sec:    232.51KB

2025-04-24 13:32:26,483 - Test completed: wrk2 -t1 -c8 -d60s -R18 --latency http://128.105.146.155/
2025-04-24 13:32:26,765 - Test Started: 15:32 rate: 20 pods: 2
2025-04-24 13:33:27,067 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 116.890ms, rate sampling interval: 802ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.86ms   41.88ms 406.53ms   98.79%
    Req/Sec    19.06      0.35    21.00     96.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.64ms
 75.000%   12.44ms
 90.000%   15.38ms
 99.000%  382.98ms
 99.900%  396.03ms
 99.990%  406.78ms
 99.999%  406.78ms
100.000%  406.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.327     0.000000            1         1.00
       4.099     0.100000          100         1.11
       5.035     0.200000          199         1.25
       5.899     0.300000          299         1.43
       7.271     0.400000          398         1.67
       8.639     0.500000          497         2.00
       9.319     0.550000          548         2.22
      10.167     0.600000          597         2.50
      10.879     0.650000          648         2.86
      11.743     0.700000          696         3.33
      12.439     0.750000          746         4.00
      12.847     0.775000          771         4.44
      13.351     0.800000          796         5.00
      13.823     0.825000          821         5.71
      14.247     0.850000          845         6.67
      14.855     0.875000          871         8.00
      15.159     0.887500          884         8.89
      15.375     0.900000          895        10.00
      15.623     0.912500          908        11.43
      16.095     0.925000          920        13.33
      17.023     0.937500          932        16.00
      17.663     0.943750          940        17.78
      17.871     0.950000          945        20.00
      18.511     0.956250          951        22.86
      19.359     0.962500          957        26.67
      20.671     0.968750          963        32.00
      21.087     0.971875          967        35.56
      21.935     0.975000          970        40.00
      22.975     0.978125          973        45.71
      24.815     0.981250          976        53.33
      28.223     0.984375          979        64.00
      29.855     0.985938          981        71.11
      30.287     0.987500          982        80.00
     382.975     0.989062          984        91.43
     385.023     0.990625          985       106.67
     386.815     0.992188          987       128.00
     388.607     0.992969          988       142.22
     388.607     0.993750          988       160.00
     392.191     0.994531          989       182.86
     393.471     0.995313          990       213.33
     394.239     0.996094          991       256.00
     394.239     0.996484          991       284.44
     394.239     0.996875          991       320.00
     394.751     0.997266          992       365.71
     394.751     0.997656          992       426.67
     396.031     0.998047          993       512.00
     396.031     0.998242          993       568.89
     396.031     0.998437          993       640.00
     396.031     0.998633          993       731.43
     396.031     0.998828          993       853.33
     406.783     0.999023          994      1024.00
     406.783     1.000000          994          inf
#[Mean    =       13.864, StdDeviation   =       41.881]
#[Max     =      406.528, Total count    =          994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1201 requests in 1.00m, 14.69MB read
Requests/sec:     20.01
Transfer/sec:    250.66KB

2025-04-24 13:33:27,368 - Test completed: wrk2 -t1 -c8 -d60s -R20 --latency http://128.105.146.155/
2025-04-24 13:33:27,645 - Test Started: 15:33 rate: 40 pods: 2
2025-04-24 13:34:27,936 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 26.294ms, rate sampling interval: 57ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.83ms    5.67ms  47.04ms   76.12%
    Req/Sec    40.00     51.19   142.00     76.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.58ms
 75.000%   13.02ms
 90.000%   16.21ms
 99.000%   29.65ms
 99.900%   40.61ms
 99.990%   47.07ms
 99.999%   47.07ms
100.000%   47.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.921     0.000000            1         1.00
       3.979     0.100000          200         1.11
       4.955     0.200000          400         1.25
       6.027     0.300000          598         1.43
       7.227     0.400000          798         1.67
       8.583     0.500000          998         2.00
       9.375     0.550000         1098         2.22
      10.079     0.600000         1196         2.50
      10.895     0.650000         1296         2.86
      11.951     0.700000         1396         3.33
      13.023     0.750000         1495         4.00
      13.503     0.775000         1545         4.44
      13.911     0.800000         1595         5.00
      14.431     0.825000         1645         5.71
      14.935     0.850000         1695         6.67
      15.479     0.875000         1744         8.00
      15.775     0.887500         1769         8.89
      16.207     0.900000         1794        10.00
      16.975     0.912500         1819        11.43
      17.983     0.925000         1844        13.33
      19.215     0.937500         1869        16.00
      19.887     0.943750         1881        17.78
      20.799     0.950000         1894        20.00
      21.631     0.956250         1906        22.86
      22.463     0.962500         1919        26.67
      23.439     0.968750         1931        32.00
      24.015     0.971875         1937        35.56
      24.671     0.975000         1944        40.00
      25.247     0.978125         1950        45.71
      25.983     0.981250         1956        53.33
      27.455     0.984375         1962        64.00
      27.775     0.985938         1965        71.11
      28.943     0.987500         1969        80.00
      29.407     0.989062         1972        91.43
      29.951     0.990625         1975       106.67
      30.591     0.992188         1978       128.00
      30.623     0.992969         1979       142.22
      31.359     0.993750         1981       160.00
      31.967     0.994531         1983       182.86
      32.255     0.995313         1984       213.33
      32.959     0.996094         1986       256.00
      32.959     0.996484         1986       284.44
      33.567     0.996875         1987       320.00
      34.879     0.997266         1988       365.71
      34.975     0.997656         1989       426.67
      38.111     0.998047         1990       512.00
      38.111     0.998242         1990       568.89
      38.111     0.998437         1990       640.00
      40.607     0.998633         1991       731.43
      40.607     0.998828         1991       853.33
      43.039     0.999023         1992      1024.00
      43.039     0.999121         1992      1137.78
      43.039     0.999219         1992      1280.00
      43.039     0.999316         1992      1462.86
      43.039     0.999414         1992      1706.67
      47.071     0.999512         1993      2048.00
      47.071     1.000000         1993          inf
#[Mean    =        9.829, StdDeviation   =        5.673]
#[Max     =       47.040, Total count    =         1993]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2401 requests in 1.00m, 29.59MB read
Requests/sec:     40.01
Transfer/sec:    504.98KB

2025-04-24 13:34:28,210 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 13:34:28,485 - Test Started: 15:34 rate: 70 pods: 2
2025-04-24 13:35:28,816 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 20.898ms, rate sampling interval: 198ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.91ms    5.77ms  53.82ms   78.00%
    Req/Sec    69.62     11.30    81.00     79.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.81ms
 75.000%   12.91ms
 90.000%   16.04ms
 99.000%   31.49ms
 99.900%   44.58ms
 99.990%   53.85ms
 99.999%   53.85ms
100.000%   53.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.936     0.000000            1         1.00
       4.035     0.100000          350         1.11
       5.043     0.200000          701         1.25
       6.087     0.300000         1049         1.43
       7.415     0.400000         1399         1.67
       8.815     0.500000         1749         2.00
       9.535     0.550000         1923         2.22
      10.375     0.600000         2100         2.50
      11.175     0.650000         2273         2.86
      12.071     0.700000         2448         3.33
      12.911     0.750000         2623         4.00
      13.311     0.775000         2711         4.44
      13.703     0.800000         2798         5.00
      14.207     0.825000         2885         5.71
      14.727     0.850000         2973         6.67
      15.335     0.875000         3059         8.00
      15.639     0.887500         3104         8.89
      16.047     0.900000         3148        10.00
      16.623     0.912500         3191        11.43
      17.647     0.925000         3234        13.33
      18.751     0.937500         3278        16.00
      19.279     0.943750         3301        17.78
      19.839     0.950000         3322        20.00
      20.783     0.956250         3344        22.86
      21.855     0.962500         3366        26.67
      22.879     0.968750         3387        32.00
      23.663     0.971875         3398        35.56
      24.847     0.975000         3409        40.00
      25.599     0.978125         3420        45.71
      26.639     0.981250         3431        53.33
      27.727     0.984375         3442        64.00
      28.399     0.985938         3447        71.11
      29.551     0.987500         3453        80.00
      30.591     0.989062         3458        91.43
      31.967     0.990625         3464       106.67
      33.567     0.992188         3469       128.00
      34.303     0.992969         3472       142.22
      34.847     0.993750         3475       160.00
      36.095     0.994531         3477       182.86
      36.223     0.995313         3480       213.33
      37.631     0.996094         3483       256.00
      37.791     0.996484         3484       284.44
      40.095     0.996875         3486       320.00
      41.599     0.997266         3487       365.71
      42.047     0.997656         3488       426.67
      42.367     0.998047         3490       512.00
      42.367     0.998242         3490       568.89
      43.455     0.998437         3491       640.00
      43.903     0.998633         3492       731.43
      43.903     0.998828         3492       853.33
      44.575     0.999023         3493      1024.00
      44.575     0.999121         3493      1137.78
      44.767     0.999219         3494      1280.00
      44.767     0.999316         3494      1462.86
      44.767     0.999414         3494      1706.67
      50.719     0.999512         3495      2048.00
      50.719     0.999561         3495      2275.56
      50.719     0.999609         3495      2560.00
      50.719     0.999658         3495      2925.71
      50.719     0.999707         3495      3413.33
      53.855     0.999756         3496      4096.00
      53.855     1.000000         3496          inf
#[Mean    =        9.905, StdDeviation   =        5.773]
#[Max     =       53.824, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 51.55MB read
Requests/sec:     70.01
Transfer/sec:      0.86MB

2025-04-24 13:35:29,099 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 13:35:29,373 - Test Started: 15:35 rate: 110 pods: 2
2025-04-24 13:36:29,671 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 11.237ms, rate sampling interval: 38ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.91ms    6.03ms  51.26ms   79.89%
    Req/Sec   111.17     50.16   216.00     64.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.58ms
 75.000%   12.91ms
 90.000%   16.32ms
 99.000%   31.41ms
 99.900%   43.17ms
 99.990%   48.32ms
 99.999%   51.29ms
100.000%   51.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.752     0.000000            1         1.00
       3.957     0.100000          551         1.11
       4.859     0.200000         1101         1.25
       5.883     0.300000         1649         1.43
       7.083     0.400000         2199         1.67
       8.583     0.500000         2748         2.00
       9.455     0.550000         3024         2.22
      10.239     0.600000         3299         2.50
      11.071     0.650000         3573         2.86
      11.967     0.700000         3848         3.33
      12.911     0.750000         4122         4.00
      13.399     0.775000         4262         4.44
      13.895     0.800000         4397         5.00
      14.423     0.825000         4539         5.71
      14.999     0.850000         4675         6.67
      15.583     0.875000         4811         8.00
      15.919     0.887500         4878         8.89
      16.327     0.900000         4948        10.00
      17.199     0.912500         5016        11.43
      18.319     0.925000         5084        13.33
      19.887     0.937500         5153        16.00
      20.495     0.943750         5188        17.78
      21.311     0.950000         5222        20.00
      22.319     0.956250         5256        22.86
      23.327     0.962500         5290        26.67
      24.975     0.968750         5325        32.00
      25.791     0.971875         5342        35.56
      26.479     0.975000         5359        40.00
      27.551     0.978125         5376        45.71
      28.479     0.981250         5393        53.33
      29.679     0.984375         5411        64.00
      29.951     0.985938         5420        71.11
      30.287     0.987500         5428        80.00
      30.959     0.989062         5436        91.43
      31.887     0.990625         5445       106.67
      33.631     0.992188         5454       128.00
      33.983     0.992969         5458       142.22
      34.655     0.993750         5463       160.00
      35.583     0.994531         5466       182.86
      36.543     0.995313         5471       213.33
      37.183     0.996094         5475       256.00
      37.919     0.996484         5477       284.44
      38.335     0.996875         5479       320.00
      38.719     0.997266         5481       365.71
      39.199     0.997656         5484       426.67
      39.743     0.998047         5486       512.00
      40.127     0.998242         5487       568.89
      41.247     0.998437         5488       640.00
      41.375     0.998633         5489       731.43
      42.655     0.998828         5490       853.33
      43.167     0.999023         5491      1024.00
      43.583     0.999121         5492      1137.78
      43.583     0.999219         5492      1280.00
      43.711     0.999316         5493      1462.86
      43.711     0.999414         5493      1706.67
      46.815     0.999512         5494      2048.00
      46.815     0.999561         5494      2275.56
      46.815     0.999609         5494      2560.00
      48.319     0.999658         5495      2925.71
      48.319     0.999707         5495      3413.33
      48.319     0.999756         5495      4096.00
      48.319     0.999780         5495      4551.11
      48.319     0.999805         5495      5120.00
      51.295     0.999829         5496      5851.43
      51.295     1.000000         5496          inf
#[Mean    =        9.905, StdDeviation   =        6.027]
#[Max     =       51.264, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 81.51MB read
Requests/sec:    110.00
Transfer/sec:      1.36MB

2025-04-24 13:36:29,967 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/